[
  {
    "name": "javascript",
    "desc": "JavaScript is a high-level interpreted scripting language with weak dynamic typing and multiparadigm features. Along with HTML and CSS, JavaScript is one of the three core technologies of the World Wide Web.",
    "img": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/javascript/javascript-original.svg"
  },
  {
    "name": "html",
    "desc": "HTML is a markup language used in the construction of web pages. HTML documents can be interpreted by web browsers.",
    "img": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/html5/html5-original.svg"
  },
  {
    "name": "css",
    "desc": "Cascading Style Sheets is a mechanism for adding style to a web document. CSS code can be applied directly in tags or contained within <style> tags. It's also possible, instead of embedding formatting within the document, to create a link to a CSS file containing the styles.",
    "img": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/css3/css3-original.svg"
  },
  {
    "name": "react",
    "desc": "React is an open-source JavaScript front-end library designed to build user interfaces for web applications.",
    "img": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/react/react-original.svg"
  },
  {
    "name": "nextjs",
    "desc": "Next.js is an open-source React front-end development web framework created by Vercel that enables functionalities such as server-side rendering and generating static websites for React-based web applications.",
    "img": "https://www.rlogical.com/wp-content/uploads/2021/08/Rlogical-Blog-Images-thumbnail.png"
  },
  {
    "name": "vuejs",
    "desc": "Vue.js is an open-source JavaScript framework focused on developing user interfaces and single-page applications.",
    "img": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/vuejs/vuejs-original.svg"
  },
  {
    "name": "angular",
    "desc": "Angular is a platform for building mobile and desktop modern, scalable web applications. It is an open-source framework maintained by Google and a community of developers. Angular offers a component-based approach to app development, making it easier to create and maintain code.",
    "img": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/angular/angular-original.svg"
  },

{
  "name": "Tailwind CSS",
  "desc": "Tailwind CSS is a highly customizable low-level CSS design framework that enables easy creation of unique and responsive user interfaces. Unlike other CSS frameworks like Bootstrap or Foundation, Tailwind doesn't come with pre-built components. Instead, it provides an extensive list of utility classes that you can use directly in your HTML to style your elements.",
  "img": "https://cdn.jsdelivr.net/gh/devicons/devicon@latest/icons/tailwindcss/tailwindcss-original.svg"
  },
  {
    "name": "typescript",
    "desc": "TypeScript is an open-source programming language developed by Microsoft. It is a strict syntactical superset of JavaScript and adds optional static typing to the language.",
    "img": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/typescript/typescript-original.svg"
  },
  {
    "name": "nodejs",
    "desc": "Node.js is open-source, cross-platform software based on the Google V8 engine that allows the execution of JavaScript code outside a web browser.",
    "img": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/nodejs/nodejs-original.svg"
  },
  {
    "name": "express",
    "desc": "Express.js is a framework for Node.js that provides minimal resources for building web servers. It was released as free and open-source software under the MIT License. It is one of the most popular frameworks for Node.js servers.",
    "img": "https://assets.website-files.com/61ca3f775a79ec5f87fcf937/6202fcdee5ee8636a145a41b_1234.png"
  },
  {
    "name": "nestjs",
    "desc": "NestJS is an open-source Node.js framework intended for building server-side applications. It was created by Kamil Mysliwiec and released in 2017. Under the hood, NestJS defaults to using the Express.js framework and is also compatible with Fastify. Its architecture is heavily inspired by Angular.",
    "img": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/nestjs/nestjs-original.svg"
  },
  {
    "name": "rust",
    "desc": "Rust is a compiled multiparadigm programming language developed by Mozilla Research. It is designed to be 'safe, concurrent, and practical', but unlike other safe languages, Rust does not use a garbage collector. It has native support for WebAssembly.",
    "img": "https://www.nicepng.com/png/full/308-3084680_rust-programming-language-rust-programming-language-logo.png"
  },
  {
    "name": "python",
    "desc": "Python is a high-level interpreted scripting language, imperative, object-oriented, functional, dynamically typed, and strongly typed. It was released by Guido van Rossum in 1991.",
    "img": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/python/python-original.svg"
  },
  {
    "name": "java",
    "desc": "Java is an object-oriented programming language developed in the 1990s by a team of programmers led by James Gosling at Sun Microsystems, which was acquired by Oracle Corporation in 2008.",
    "img": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/java/java-plain.svg"
  },
  {
    "name": "git",
    "desc": "Git is a distributed version control system, primarily used in software development, but it can be used to track changes in any type of file.",
    "img": "https://git-scm.com/images/logos/downloads/Git-Icon-1788C.png"
  },
  {
    "name": "heroku",
    "desc": "Heroku is a platform as a service that supports various programming languages. One of the earliest cloud platforms.",
    "img": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/heroku/heroku-plain.svg"
  },
  {
    "name": "mongodb",
    "desc": "MongoDB is a free, open-source, cross-platform document-oriented database software.",
    "img": "https://img.icons8.com/color/480/mongodb.png"
  },
  {
    "name": "mysql",
    "desc": "MySQL is a database management system that uses SQL as its interface language. It is currently one of the most popular database management systems from Oracle Corporation, with over 10 million installations worldwide.",
    "img": "https://pngimg.com/uploads/mysql/mysql_PNG11.png"
  },
  {
    "name": "spring",
    "img": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/spring/spring-original.svg",
    "desc": "Spring is an open-source framework for the Java platform created by Rod Johnson and described in his book 'Expert One-on-One: JEE Design and Development'. It is a non-intrusive framework, based on the inversion of control and dependency injection design patterns."
  },
  {
    "name": "rabbitMQ",
    "img": "https://images.ctfassets.net/o7xu9whrs0u9/6qR4PTwCTfgl0tjfrz0lpy/819fecae70412dacb9b960b98f5fae3b/RabbitMQ-LOGO.png",
    "desc":"RabbitMQ is an open-source messaging software that has implemented the 'Advanced Message Queuing Protocol', which has been extended with a plug-in architecture to support the 'Streaming Text Oriented Messaging Protocol', MQTT among other protocols."
  },
  {
    "name": "redis",
    "img": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/redis/redis-original.svg",
    "desc": "Redis is an in-memory data structure store, used as a distributed key-value database, cache, and message broker, with optional durability."
  },
  {
    "name": "docker",
    "desc": "Docker is a set of platform as a service products that use OS-level virtualization to deliver software in packages called containers. Containers are isolated from one another and bundle their own software, libraries, and configuration files.",
    "img": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/docker/docker-original.svg"
  }
]
