
[
  {
    "type": "front",
    "img": "https://i.ibb.co/gwDKnt9/image.png",
    "resume": "NextJs landing page for the SuperSoft management system, available in Portuguese and English.",
    "title": "SuperSoft - Landing Page",
    "link": "https://erwinsystems-supersoft.netlify.app/",
    "linkRepo": "https://github.com/AricodeLab/supersoft.com",
    "stack": ["typescript", "nextjs", "css"]
  },
  {
    "type": "front",
    "title": "JoJo List",
    "link": "https://jojolist.netlify.app/",
    "linkRepo": "https://github.com/isaias-silva/jojolist-version-basic-",
    "img": "https://i.ibb.co/FxSc7fM/Whats-App-Image-2022-10-22-at-14-56-14.jpg",
    "resume": "Web application that consumes JoJoApi and displays all 'stands' from JoJo's Bizarre Adventure manga, built with HTML, CSS, and JavaScript.",
    "stack": ["javascript", "html", "css"]
  },
  {
    "type": "front",
    "title": "JoJo List React version",
    "link": "https://jojo-list.netlify.app/",
    "linkRepo": "https://github.com/isaias-silva/jojolist-react-version",
    "img": "https://i.ibb.co/y6h136R/Captura-de-tela-de-2022-10-22-15-26-38.png",
    "resume": "Web application made with ReactJs that consumes JoJoApi and displays all 'stands' from JoJo's Bizarre Adventure manga. This project is a React adaptation ('re-code') of the previous one.",
    "stack": ["react", "javascript", "html", "css"]
  },
  {
    "type": "front",
    "title": "floatbook",
    "linkRepo": "https://github.com/isaias-silva/floatbook-frontend",
    "img": "https://i.ibb.co/VQvQV22/Captura-de-tela-de-2022-10-23-14-01-42.png",
    "resume": "An engaging interface inspired by Facebook, meticulously developed using React. The 'floatbook' project provides a visually immersive experience, presenting a structure similar to the popular social network. Combining React, TypeScript, and CSS, the application not only replicates the aesthetics of Facebook but also incorporates the interaction and navigation dynamics characteristic of the platform.",
    "stack": ["react", "typescript", "css"]
  },
  {
    "type": "front",
    "title": "analog clock",
    "link": "https://black-clock.netlify.app/",
    "linkRepo": "https://github.com/isaias-silva/relogio-analogico-js",
    "img": "https://raw.githubusercontent.com/isaias-silva/relogio-analogico-js/main/images_example/example.png",
    "resume": "Analog clock with hour, minute, and second hands, using circle geometry and angles, created using HTML, CSS, and JS with Object-Oriented Programming paradigm.",
    "stack": ["javascript", "html", "css"]
  },
  {
    "type": "front",
    "title": "calculator Js",
    "link": "https://green-calculator.netlify.app/",
    "linkRepo": "https://github.com/isaias-silva/calculator-web-version",
    "img": "https://i.ibb.co/23FrXcF/Captura-de-tela-de-2023-12-27-12-58-10.png",
    "resume": "Web calculator application using HTML, CSS, JS, and code obfuscation. Utilizes mathematical logic for calculations such as addition, subtraction, division, multiplication, exponentiation, square root, and approximation of pi.",
    "stack": ["javascript", "html", "css"]
  },
  {
    "type": "back",
    "title": "jojoapi",
    "linkRepo": "https://github.com/isaias-silva/jojoapi",
    "img": "https://www.arkade.com.br/wp-content/uploads/2023/03/509145-JoJos-Bizarre-Adventure-Jonathan-Joestar-Joseph1-1050x591.jpg",
    "resume": "The 'jojoapi' is a comprehensive solution providing detailed information about the 'stands' characters from JoJo's Bizarre Adventures manga. Developed with JavaScript (Node.js), TypeScript, Express, and utilizing a MySQL database for storage, this application is a fusion of efficiency and robustness. With a strong foundation in HTTP requests, jojoapi offers a fast and reliable query experience for fans, ensuring smooth interaction and accurate data about the fascinating characters of the JoJo universe.",
    "stack": ["typescript", "express", "docker", "mysql"]
  },
  {
    "type": "back",
    "title": "scrapApi",
    "linkRepo": "https://github.com/isaias-silva/scrapy-api",
    "img": "https://miro.medium.com/max/641/1*4GVSbbdBhWr73IgBykO5hA.png",
    "resume": "API that performs data extraction (web scraping) from the 'Pensador' quotes website. The functionality allows choosing a specific theme during the request, returning a JSON containing all quotes associated with the selected theme. Developed with TypeScript and Puppeteer, this application provides an efficient way to obtain inspiring and relevant content according to user preferences.",
    "stack": ["typescript", "express"]
  },
  {
    "type": "auto",
    "title": "sophy-bot",
    "linkRepo": "https://github.com/isaias-silva/sophy-bot",
    "img": "https://umnico-cdn.com/production/landing/en-article25.png",
    "resume": "The 'sophy-bot' is an advanced WhatsApp chatbot designed to simplify group management. Expertly developed in TypeScript, this multifunctional bot not only manages groups but also offers features such as downloading and sending music and videos from YouTube directly through WhatsApp. Additionally, the 'sophy-bot' can create custom stickers, add and remove members, and even remove unwanted ads, providing an enhanced experience in the WhatsApp environment.",
    "stack": ["typescript", "docker", "nodejs"]
  },
  {
    "type": "auto",
    "title": "instabot",
    "linkRepo": "https://github.com/isaias-silva/instabot",
    "img": "https://socialpros.co/wp-content/uploads/2018/12/breakfast-lunch-www.brunch.com-1.png",
    "resume": "The 'instabot' is a powerful tool developed to boost organic engagement on Instagram profiles. Created masterfully in JavaScript and utilizing the effectiveness of Puppeteer, this automated bot performs strategic actions such as smart and targeted following. With 'instabot', it's possible to increase visibility and interaction organically, providing a more effective presence in the Instagram digital landscape.",
    "stack": ["javascript", "nodejs"]
  },
  {
    "type": "auto",
    "title": "smaug Bot",
    "linkRepo": "https://github.com/isaias-silva/smaugbot",
    "img": "https://www.fatosdesconhecidos.com.br/wp-content/uploads/2018/01/Smaug-1-1024x576.jpg",
    "resume": "The 'smaug Bot' is an innovative desktop application that connects directly to WhatsApp, displaying all received messages in real-time. Developed masterfully in TypeScript, this application uses WebSocket communication to ensure instant synchronization of messages. Furthermore, rendering is done through the EJS view engine, providing an intuitive and dynamic interface. With 'smaug Bot', it's possible to respond to messages directly through the application, offering a more efficient interaction experience.",
    "stack": ["typescript", "express"]
  }
]
